---
kind: property
id: P:Autodesk.Revit.DB.Construction.Name
source: html/ac848e85-9fb3-91d6-0d6b-54e1cf1011e7.htm
---
# Autodesk.Revit.DB.Construction.Name Property

Get the name of the Construction.

## Syntax (C#)
```csharp
public string Name { get; }
```

## Remarks
This property is used to get the name of the Construction.